# Brewfile — managed by dotfiles/install.sh
# Run manually: brew bundle

# ── GitHub Actions ────────────────────────────────────────────────────────────
brew "act"           # run Actions locally
brew "actionlint"    # lint workflow files

# ── Shell & terminal ──────────────────────────────────────────────────────────
brew "zsh"
brew "tmux"
brew "fzf"

# ── Editors ───────────────────────────────────────────────────────────────────
brew "vim"

# ── Search ────────────────────────────────────────────────────────────────────
brew "the_silver_searcher"   # ag
brew "ripgrep"               # rg

# ── Git ───────────────────────────────────────────────────────────────────────
brew "git"
brew "git-delta"             # prettier diffs
brew "diff-so-fancy"         # even prettier diffs (used as git pager in git/gitconfig)
brew "git-lfs"
brew "gh"                    # GitHub CLI
brew "jj"                    # Jujutsu VCS

# ── GNU coreutils (replaces macOS BSD versions) ───────────────────────────────
brew "coreutils"
brew "findutils"
brew "gnu-sed"
brew "grep"
brew "gawk"
brew "gnu-tar"

# ── Linting ───────────────────────────────────────────────────────────────────
brew "shellcheck"    # lint shell scripts

# ── Misc utilities ────────────────────────────────────────────────────────────
brew "bat"                   # cat with syntax highlighting
brew "curl"
brew "d2"                    # text-to-diagram
brew "difftastic"            # syntax-aware diff
brew "dust"                  # intuitive du
brew "fd"                    # friendlier find
brew "jq"
brew "lsd"                   # ls with icons
brew "mosh"                  # remote shell over UDP
brew "procs"                 # modern ps
brew "sd"                    # find & replace CLI
brew "thefuck"               # corrects previous console commands
brew "tree"

# ── Casks ─────────────────────────────────────────────────────────────────────
cask "1password-cli"
cask "iterm2"
cask "font-jetbrains-mono-nerd-font"   # required for tmux/powerline symbols to render correctly
